In [1]:
import pandas as pd

In [2]:
import pandas as pd 

df = pd.DataFrame({
    'nome': ["Fortaleza", "fortaleza ", "FORTALEZA", "FoRTALeZA"],
    'data_validade': ['2022-01-01','2022-01-06','2022-01-07','2022-01-02']
})
df

         nome data_validade
0   Fortaleza    2022-01-01
1  fortaleza     2022-01-06
2   FORTALEZA    2022-01-07
3   FoRTALeZA    2022-01-02

In [3]:
def conv_data(x):
    return pd.to_datetime(x)

In [4]:
df.data_validade = df.data_validade.apply(conv_data)

In [5]:
df

         nome data_validade
0   Fortaleza    2022-01-01
1  fortaleza     2022-01-06
2   FORTALEZA    2022-01-07
3   FoRTALeZA    2022-01-02